import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-bi',
  templateUrl: './bi.component.html',
  styleUrls: ['./bi.component.css']
})
export class BIComponent implements OnInit {

  selectedIndex = false;


  biElements = [
    {
      title: 'Базаи маълумот',
      about: 'маҷмӯи маълумоти номдошта, ки маҷмӯи объектҳо  ва муносибати онҳоро дар ягон соҳаи предметӣ тасвир мекунад. ',
      title_ru: 'База данных',
      about_ru: 'совокупность взаимосвязанных, хранящихся вместе данных при наличии такой минимальной избыточности, которая допускает их использование оптимальным образом для одного или нескольких приложений.',
      image: '',
    },
    {
      title: 'СИБМ',
      about: 'барномаи компютерӣ, ки ба истифодабаранда имконияти сохтан, дастгирӣ ва идоракунии БМ-ро медиҳад',
      title_ru: 'СУБД',
      about_ru: 'совокупность программных и лингвистических средств общего или специального назначения, обеспечивающих управление созданием и использованием баз данных. СУБД — ком­плекс про­грамм, по­зво­ляю­щих соз­дать ба­зу дан­ных и ма­ни­пу­ли­ро­вать дан­ны­ми. ',
      image: '',
    },
    {
      title: 'MySQL ',
      about: 'системаи озод барои идораи БМ аст, ки дар асоси клиент – сервер кор мекунад. ',
      title_ru: 'MySQL',
      about_ru: 'свободная реляционная система управления базами данных. ',
      image: '',
    },
    {
      title: 'Иттилоот',
      about: 'маълумоте оиди одамон, ашёҳо, ходисаҳ о ва чараёнҳое, ки аз намуди тарзи нишон додани он новобаста мебошад.',
      title_ru: 'информация',
      about_ru: 'сведения независимо от формы их представления. ',
      image: '',
    },
    {
      title: 'Калид',
      about: 'миқдори минималии атрибутҳо, ки аз рӯи қиммати он мо метавонем нусхаи лозимаи моҳиятро дарёфт намоем.',
      title_ru: 'Ключ',
      about_ru: '',
      image: '',
    },
    {
      title: 'Алоқа',
      about: 'ин тасаввуроти ду ва ё зиёда  мохият мебошад. Аз сабаби он, ки манбаи маълумот дар худ гурухи зиёди мохиятро дорад, пас аз руи як мохият дигар мохиятро бо воситаи алокаи онхо чустучу намудан мумкин аст',
      title_ru: 'Связь (relationship)',
      about_ru: 'это графически изображаемая ассоциация, устанавливаемая между двумя сущностями. Связь может существовать между двумя разными сущностями или между сущностью и ей же самой (рекурсивная связь). ',
      image: '',
    },
    {
      title: 'Созкунӣ',
      about: 'ин чараёни таксимкунии як чадвал ба ду ва ё зиёда чадвалхо, ки хосияти хуби ичро намудани дохилкуни, иловакуни, хоричкуниро дорад',
      title_ru: 'нормализация',
      about_ru: 'свойство отношения в реляционной модели данных, характеризующее его с точки зрения избыточности, потенциально приводящей к логически ошибочным результатам выборки или изменения данных.',
      image: '',
    },
    {
      title: 'Яклухтӣ',
      about: 'ин дурустии маълумотҳо дар дилхоҳ вақт фаҳмида мешавад.  Ин амал танҳо бо талаботҳои муайян ба даст оварда мешавад.',
      title_ru: 'целостность данных',
      about_ru: 'соответствие имеющейся в базе данных информации её внутренней логике, структуре и всем явно заданным правилам. ',
      image: '',
    },
    {
      title: 'SQLyog',
      about: 'ин интерфейси графикии истифодабаранда барои системаи БМ релятсионӣ мебошад. ',
      title_ru: 'SQLyog',
      about_ru: 'это графический интерфейс пользователя для популярной системы реляционных баз данных MySQL.',
      image: '',
    },
    {
      title: 'Модели маълумот',
      about: 'тарзи нигоҳдории маълумот мебошад.',
      title_ru: 'Модель данных ',
      about_ru: 'совокупность структур данных, ограничений целостности и операций манипулирования данными. Модели используются для представления данных в информационных системах',
      image: '',
    },
    {
      title: 'Базаи маълумоти релятсионӣ',
      about: 'чунин намуди  БМ, ки дар он маълумот  ба намуди ҷадвали дученака ҷойгир карда мешавад.',
      title_ru: 'Реляционная база данных',
      about_ru: 'база данных, основанная на реляционной модели данных.',
      image: '',
    },
    {
      title: 'Лоиҳакашии консептуалӣ',
      about: 'ташкили модели иттилоотӣ – мантиқии соҳаи предметии БМ аст. Одатан, бо истифодаи воситаи графикӣ (ER-модел) тартиб дода мешавад.',
      title_ru: 'Концептуальное (инфологическое) проектирование',
      about_ru: 'построение семантической модели предметной области, то есть информационной модели наиболее высокого уровня абстракции. Такая модель создаётся без ориентации на какую-либо конкретную СУБД и модель данных. ',
      image: '',
    },
    {
      title: 'Лоиҳакашии мантиқӣ',
      about: 'тасвири модели иттилоотӣ – мантиқӣ дар модели маълумоти СИБМ. Барои СИБМ релятсионӣ модели мантиқӣ, марзаи калидӣ ва алоқаи онҳоро тасвир мекунад.',
      title_ru: 'Логическое проектирование',
      about_ru: '',
      image: '',
    },
    {
      title: 'Лоиҳакашии физикӣ',
      about: 'амаликунии модели мантиқӣ бо истифодаи воситаи СИБМ.',
      title_ru: 'Физическое проектирование',
      about_ru: 'процесс подготовки описания реализации базы данных на вторичных запоминающих устройствах; на этом этапе рассматриваются основные отношения, организация файлов и индексов, предназначенных для обеспечения эффективного доступа к данным',
      image: '',
    },
    {
      title: 'Соҳаи предметӣ',
      about: 'қисми олами реалӣ, ки бо воситаи БМ моделиронӣ мешавад.',
      title_ru: 'Предметная область',
      about_ru: 'часть реального мира, которая описывается или автоматизируется при создании базы данных. Например: склад, магазин, библиотека, автозаправка',
      image: '',
    },
    {
      title: 'Моҳият',
      about: '',
      title_ru: 'Сущность (entity)',
      about_ru: 'это реальный или представляемый тип объекта, информация о котором должна сохраняться и быть доступна. ',
      image: '',
    },
    {
      title: 'Атрибут',
      about: 'хосияти моҳият.',
      title_ru: 'Атрибут',
      about_ru: 'свойство сущности',
      image: '',
    },
    {
      title: 'Алоқа(Relation)',
      about: 'алоқаи мантиқии байни ду моҳият мебошад. ',
      title_ru: 'Отншение',
      about_ru: 'фундаментальное понятие реляционной модели данных.',
      image: '',
    },
    {
      title: 'ER-модел',
      about: 'Entity Relationship, чунин модели маълумотест, ки имконияти тасвири схемаҳои консептуалиро дорад.',
      title_ru: 'ER-модел',
      about_ru: 'модель данных, позволяющая описывать концептуальные схемы предметной области. ER-модель используется при высокоуровневом (концептуальном) проектировании баз данных.',
      image: '',
    },
    {
      title: 'Схемаи БМ',
      about: 'тасвири графикии моҳиятҳои соҳаи предметӣ, ки муносибатҳои мантиқии байни онҳо муайян шудааст. ',
      title_ru: 'Схема БД',
      about_ru: 'Схема базы данных включает в себя описания содержания, структуры и ограничений целостности, используемые для создания и поддержки базы данных. Постоянные данные в среде базы данных включают в себя схему и базу данных',
      image: '',
    },
    {
      title: 'INTEGER',
      about: 'намуди маълумот, намуди маълумоти ададии бутун аст.',
      title_ru: 'INTEGER',
      about_ru: 'Целое, целочисленный тип данных, в информатике — один из простейших и самых распространённых типов данных в языках программирования',
      image: '',
    },
    {
      title: 'FLOAT',
      about: 'намуди маълумот, намуди маълумоти ададии ҳақиқӣ аст.',
      title_ru: 'FLOAT',
      about_ru: 'форма представления вещественных чисел, в которой число хранится в форме мантиссы и показателя степени.',
      image: '',
    },
    {
      title: 'VARCHAR',
      about: 'намуди маълумот, намуди маълумоти сатрӣ аст.',
      title_ru: 'VARCHAR',
      about_ru: 'строковый тип переменной длины.',
      image: '',
    },
    {
      title: 'ENUM',
      about: 'намуди маълумот, намуди маълумоти матнӣ аст.',
      title_ru: 'ENUM',
      about_ru: ' в программировании тип данных, чьё множество значений представляет собой ограниченный список идентификаторов.',
      image: '',
    },
    {
      title: 'TEXT',
      about: 'намуди маълумот, намуди маълумоти матнӣ аст.',
      title_ru: 'TEXT',
      about_ru: '',
      image: '',
    },
    {
      title: 'BLOB',
      about: 'намуди маълумот, намуди маълумоти матнӣ аст.',
      title_ru: 'BLOB',
      about_ru: '',
      image: '',
    },
    {
      title: 'VARCHAR',
      about: '',
      title_ru: 'VARCHAR',
      about_ru: 'Может хранить не более 255 символов.',
      image: '',
    },
    {
      title: 'MEDIUMTEXT',
      about: 'Может хранить не более 16 777 215 символов.',
      title_ru: '',
      about_ru: '',
      image: '',
    },
    {
      title: 'LONGTEXT',
      about: '',
      title_ru: 'LONGTEXT',
      about_ru: 'Может хранить не более 4 294 967 295 символов.',
      image: '',
    },
    {
      title: 'UNSIGNED',
      about: '',
      title_ru: 'UNSIGNED',
      about_ru: 'задает беззнаковые числа.',
      image: '',
    },
    {
      title: 'DOUBLE',
      about: '',
      title_ru: 'DOUBLE',
      about_ru: 'Число с плавающей точкой двойной точности.',
      image: '',
    },
    {
      title: 'NUMERIC',
      about: '',
      title_ru: 'NUMERIC',
      about_ru: 'Синоним для DECIMAL.',
      image: '',
    },
    {
      title: 'DECIMAL',
      about: '',
      title_ru: 'DECIMAL',
      about_ru: 'Дробное число, хранящееся в виде строки.',
      image: '',
    },
    {
      title: 'REAL',
      about: '',
      title_ru: 'REAL',
      about_ru: 'Синоним для DOUBLE.',
      image: '',
    },
    {
      title: 'FLOAT',
      about: '',
      title_ru: 'FLOAT',
      about_ru: 'Число с плавающей точкой небольшой точности.',
      image: '',
    },
    {
      title: 'DATE',
      about: 'намуди маълумот, намуди маълумоти сана ва вақт.',
      title_ru: 'DATE',
      about_ru: '',
      image: '',
    },
    {
      title: 'InnoDB',
      about: 'намуди ҷадвал.',
      title_ru: 'InnoDB',
      about_ru: '',
      image: '',
    },
    {
      title: 'MyISAM',
      about: 'намуди ҷадвал',
      title_ru: 'MyISAM',
      about_ru: 'одна из основных (наряду с InnoDB) систем хранения данных в СУБД MySQL. Она основывается на принципах ISAM и обладает в сравнении с ним рядом полезных дополнений. ',
      image: '',
    },
    {
      title: 'SQL',
      about: 'забони дархостҳои структуриронӣ, ки барои сохтан, модификатсия ва идораи базаи маълумотҳо дар базаи маълумоти релятсионӣ истифода мешавад.' ,
      title_ru: 'SQL',
      about_ru: 'декларативный язык программирования, применяемый для создания, модификации и управления данными в реляционной базе данных, управляемой соответствующей системой управления базами данных.',
      image: '',
    },
    {
      title: 'Ҷадвал',
      about: 'объекти асосии базаи маълумот, ки маълумот дар он нигоҳ дошта мешавад.    ',
      title_ru: 'Таблица',
      about_ru: 'способ хранения информации в реляционной базе данных (минимальная единица измерения в базе данных). Таблицей упрощенно называют отношение в базе данных.',
      image: '',
    },
    {
      title: 'DDL',
      about: 'Data Definition Language, забони  муайянкунии маълумот',
      title_ru: 'DDL',
      about_ru: ' это семейство компьютерных языков, используемых в компьютерных программах для описания структуры баз данных.',
      image: '',
    },
    {
      title: 'DML',
      about: 'Data Manipulation Language, забони идораи маълумот',
      title_ru: 'DML',
      about_ru: 'это семейство компьютерных языков, используемых в компьютерных программах или пользователями баз данных для получения, вставки, удаления или изменения данных в базах данных',
      image: '',
    },
    {
      title: 'TCL',
      about: 'Transaction Control Language, забони идоракунии транзаксияҳо',
      title_ru: 'TCL',
      about_ru: 'компьютерный язык и часть SQL, используемый для обработки транзакций. ',
      image: '',
    },
    {
      title: 'CREATE',
      about: 'фармони забони DDL, барои сохтани базаи маълумот, ҷадвалҳо, ҷадвалҳои виртуалӣ, индекс, триггер истифода мешавад.',
      title_ru: 'CREATE',
      about_ru: ' DDL оператор языка SQL, используемый для создания объектов базы данных. В различных СУБД может использоваться для создания различных объектов, например таблиц, схем, представлений.',
      image: '',
    },
    {
      title: 'ALTER',
      about: 'тағйир додан”, фармони забони DDL , барои модифитсиронии ҷадвал, ҷадвали виртуалӣ, индекс, триггер, протседура истифода мешавад.',
      title_ru: 'ALTER',
      about_ru: 'Оператор ALTER TABLE обеспечивает возможность изменять структуру существующей таблицы. Например, можно добавлять или удалять столбцы, создавать или уничтожать индексы или переименовывать столбцы либо саму таблицу.',
      image: '',
    },
    {
      title: 'DROP',
      about: 'барои хориҷкунии ҷадвал ё базаи маълумот истифода мешавад.',
      title_ru: 'DROP',
      about_ru: 'Оператор DROP TABLE используется для удаления существующей таблицы в базе данных.',
      image: '',
    },
    {
      title: 'SHOW',
      about: 'оператор барои муайянкунии мавҷудияти ҷадвал ё базаи маълумот.',
      title_ru: 'SHOW',
      about_ru: 'выдает список таблиц,баз данных на компьютере',
      image: '',
    },
    {
      title: 'GRANT',
      about: 'муайянкунии махдудият',
      title_ru: 'GRANT',
      about_ru: 'Команда GRANT используется для назначения привилегий пользователям.',
      image: '',
    },
    {
      title: 'FROM',
      about: 'калимаи калидӣ, монанди SELECT, ки бояд дар ҳар як дархост пешниҳод шавад. Вай бо ҳамроҳи фосила (пробел) ва номи ҷадвал, ки чун сарчашмаи маълумот истифода мегардад, оварда мешавад',
      title_ru: 'FROM',
      about_ru: '',
      image: '',
    },
    {
      title: 'REVOKE',
      about: 'инкори маъдудиятхо',
      title_ru: 'REVOKE',
      about_ru: 'Отменяет разрешения, предоставленные или запрещенные для пользователя базы данных, роли базы данных или роли приложения.',
      image: '',
    },
    {
      title: 'DESC',
      about: 'оператор барои гирифтани маълумоти сутунҳои ҷадвал аст',
      title_ru: 'DESC',
      about_ru: '',
      image: '',
    },
    {
      title: 'PRIMARY KEY ',
      about: 'калиди дохилӣ; барои идентификатсияи уникалии маълумоти ҷадвал истифода мешавад',
      title_ru: 'PRIMARY KEY',
      about_ru: '',
      image: '',
    },
    {
      title: 'FOREIGN KEY',
      about: 'калиди беруна; чунин намуди марзае, ки бо марзаи ҷадвали дигар пайваст аст, яъне қимати ин марза аз марзаи калиди аввала вобаста аст.',
      title_ru: 'FOREIGN KEY',
      about_ru: '',
      image: '',
    },
    {
      title: 'UTF8',
      about: 'Unicode Transformation Format, яке аз кодировкаи стандартии матнӣ, ки имконияти нигоҳдории символҳои Юникодро дорад. Миқдори байт аз 1 то 6.',
      title_ru: 'UTF8',
      about_ru: '',
      image: '',
    },
    {
      title: 'Майдон',
      about: 'хосияти моҳияти тавсифшаванда;',
      title_ru: 'Майдон',
      about_ru: '',
      image: '',
    },
    {
      title: 'Сабт(record)',
      about: 'як сатри ҷадвал',
      title_ru: 'Строка',
      about_ru: '',
      image: '',
    },
    {
      title: 'INSERT',
      about: 'оператори забони SQL , ки дар ҷадвали мавҷудбуда сабтҳои навро ворид мекунад.',
      title_ru: 'INSERT',
      about_ru: '',
      image: '',
    },
    {
      title: 'DELETE',
      about: 'оператори забони sql, ки сатрҳои ҷадвалро хориҷ мекунад, агар шарти муайянкунандаи where ба он ҷавобгӯ бошад.',
      title_ru: 'DELETE',
      about_ru: '',
      image: '',
    },
    {
      title: 'UPDATE',
      about: 'оператори забони sql, ки майдонҳои сатри мавҷудбударо бо қимматҳои нав аз нав месозад',
      title_ru: 'UPDATE',
      about_ru: '',
      image: '',
    },
    {
      title: 'LOAD DATA',
      about: 'операторе,ки аз файли матнӣ сабтҳоро хонда, бо суръти баланд, ба ҷадвал маълумотро дохил мекунад',
      title_ru: 'LOAD DATA',
      about_ru: '',
      image: '',
    },
    {
      title: 'REPLACE',
      about: 'операторе,ки монанди INSERT кор мекунад, лекин агар сатри бо ҳамон як калиди уникалӣ вуҷуд дошта бошад, сатри кӯҳна хориҷ карда шуда, сатри нав ба ҷояш илова мешавад',
      title_ru: 'REPLACE',
      about_ru: '',
      image: '',
    },
    {
      title: 'TRUNCATE TABLE',
      about: 'операторе,ки ба пурраги маълумоти ҷавалро хориҷ мекунад.',
      title_ru: 'TRUNCATE TABLE',
      about_ru: '',
      image: '',
    },
    {
      title: 'SET',
      about: 'намуди маълумоти сатрӣ майдони типи SET дилхоҳ миқдори қимматҳои додашударо нигоҳ медорад. Маълумот метавонад, бо аломати “,” ҷудо шавад.',
      title_ru: 'SET',
      about_ru: '',
      image: '',
    },
    {
      title: 'SELECT',
      about: 'оператори забони SQL, ки барои гирифтани сабтҳо аз як ё якчанд ҷадвалҳо хизмат мерасонад.',
      title_ru: 'SELECT',
      about_ru: '',
      image: '',
    },
    {
      title: 'AS',
      about: 'калимаи калидии операторҳои SQL, ки барои гузоштани номи муваққатӣ ба идентификаторҳои майдон ё ҷадвалҳо хизмат мекунад.',
      title_ru: 'AS',
      about_ru: '',
      image: '',
    },
    {
      title: 'WHERE',
      about: 'калимаи калидии операторҳои SQL, ки барои гузоштани шарт, барои гирифтани дилхоҳ маълумот истифода бурда мешавад.',
      title_ru: 'WHERE',
      about_ru: '',
      image: '',
    },
    {
      title: 'OR',
      about: 'калимаи калидии операторҳои SQL, ки дар вақти гузоштани шарт истифода шуда, барои интхоб карда гирифтани маълумот хиз мат мекунад.',
      title_ru: 'OR',
      about_ru: '',
      image: '',
    },
    {
      title: 'ORDER BY',
      about: 'яке аз функсияи операторҳо, ки барои батартибории сабтҳои майдонҳои ҷадвал хизмат мерасонад',
      title_ru: 'ORDER BY',
      about_ru: '',
      image: '',
    },
    {
      title: 'DESC',
      about: 'функсияи операторҳо,ки аз рӯи камшавӣ маълумоти ҷадвалро батартиб морад.',
      title_ru: 'DESC',
      about_ru: '',
      image: ''
    },
    {
      title: 'HAVING',
      about: 'функсияе,ки барои гузоштани шарт ба функсияи Group by хизмат мерасонад. Ба монанди истифодабарии where дар оператори select аст, вале Having баъди функсияи group by навишта мешавад.',
      title_ru: 'HAVING',
      about_ru: '',
      image: ''
    },
    {
      title: 'LIMIT',
      about: 'функсияи операторҳо,ки миқдори сатрҳои додашударо муайян мекунад.',
      title_ru: 'LIMIT',
      about_ru: '',
      image: ''
    },
    {
      title: 'OUTFILE',
      about: 'функсияе,ки маълумотҳои ҷадвалро аз файли беруна мехонад.',
      title_ru: 'OUTFILE',
      about_ru: '',
      image: ''
    },
    {
      title: 'DISTINCT',
      about: 'функсияе,ки қимматҳои ҳархелаи ҷадвалро бармегардонад.',
      title_ru: 'DISTINCT',
      about_ru: '',
      image: ''
    },
    {
      title: 'Оператор',
      about: 'ин сохтор(конструксия)-и забон, ки маълумотҳоро тағйир медиҳад.',
      title_ru: 'Оператор',
      about_ru: '',
      image: ''
    },
    {
      title: 'Операнд',
      about: 'маълумотҳое, ки аз болои онҳо ягон амал иҷро мешавад.',
      title_ru: 'Операнд',
      about_ru: '',
      image: ''
    },
    {
      title: 'Функсияи Greatest()',
      about: 'қиммати калонтаринро аз рӯёхати қиматҳои додашудабар мегардонад.',
      title_ru: 'Функсияи Greatest()',
      about_ru: '',
      image: ''
    },
    {
      title: 'Функсияи Least',
      about: 'баръакси функсияи Greatest кор мекунад, яъне аз рёйхати қимматҳои додашуда, хурдтаринашро',
      title_ru: 'Функсияи Least',
      about_ru: '',
      image: ''
    },
    {
      title: 'JOIN',
      about: 'операторе, ки ҷадвалҳоро бо ҳам пайваст мекунад.',
      title_ru: 'JOIN',
      about_ru: '',
      image: ''
    },
    {
      title: 'LEFT JOIN',
      about: 'ҳамҷоякунии берунӣ аз тарафи чап.',
      title_ru: 'LEFT JOIN',
      about_ru: '',
      image: ''
    },
    {
      title: 'ON',
      about: 'калимаи калидӣ, барои ҳамҷоякунии ҷадвал бо оператори  JOIN истифода мешавад. ',
      title_ru: 'ON',
      about_ru: '',
      image: ''
    },
    {
      title: 'USING',
      about: 'калимаи калидӣ, тарзи пайвасткунии  муносибати байни 2 ҷадвал ҳангоми ҳамҷоякунии онҳоро нишон медиҳад.',
      title_ru: 'USING',
      about_ru: '',
      image: ''
    },
    {
      title: 'INNER JOIN',
      about: 'ҳамҷоякунии дохилии ҷадвалҳо',
      title_ru: 'INNER JOIN',
      about_ru: '',
      image: ''
    },
    {
      title: 'CROSS JOIN',
      about: 'ҳамҷоякунии чортарафи ҷадвал',
      title_ru: 'CROSS JOIN',
      about_ru: '',
      image: ''
    },
    {
      title: 'Дархост',
      about: '',
      title_ru: 'Запрос',
      about_ru: '',
      image: ''
    },
    {
      title: 'Зердархост',
      about: 'дархости воридшуда, дарунӣ ё дархости тобеъ) гуфта, дархостеро меноманд, ки натиҷаи он дар дохили дигар дархост истифода мешавад. Одатан зердархостҳо бо оператори SELECT ташкил карда мешаванд.',
      title_ru: 'Подзапрос',
      about_ru: '',
      image: ''
    },
    {
      title: 'Курсор',
      about: ' это указатель на ряд. Курсор в SQL – это область в памяти БД, которая предназначена для хранения последовательности оператора SQL.',
      title_ru: 'Курсор',
      about_ru: '',
      image: ''
    },
    {
      title: 'Триггер',
      about: 'ин протседураи нигоҳдошташавандаи намуди махсус мебошад, ки бевосита аз тарафи истифодабаранда ҷеғ зада намешавад, балки дар асоси рӯй додани ягон ҳодиса ба монанди иловакунии маълумот INSERT ба ягон ҷадвал ё хориҷкунии маълумот DELETE аз сатри ҳамин ҷадвал, азнавкунии маълумот UPDATE дар марзаи муайяни ҷадвали БМ релятсионӣ иҷро мегардад.',
      title_ru: 'Триггер',
      about_ru: 'это хранимая процедура особого типа, исполнение которой обусловлено наступлением определенного события.',
      image: ''
    },
    {
      title: 'Фарзият VIEW',
      about: 'ин дархост барои интихоб(SELECT), ки ба он номи уникали дода мешавад ва онро ба монанди ПН аз БМ сабт ва хориҷ карда мешавад. ',
      title_ru: 'Фарзият VIEW',
      about_ru: '',
      image: ''
    },
    {
      title: 'OleDbConnection',
      about: 'пайвастшавии кушод ба сарчашмаи маълумотхоро пешниход мекунад',
      title_ru: 'OleDbConnection',
      about_ru: '',
      image: ''
    },
    {
      title: 'OleDbCommand',
      about: 'оператори SQL ё протседура, ки барои сарчашмаи маълумот истифода бурда мешавад, пешниход мекунад.',
      title_ru: 'OleDbCommand',
      about_ru: '',
      image: ''
    },
    {
      title: 'OleDbDataAdapte',
      about: 'командахои маълумот ва пайвастшави ба базаи маълумотро пешниход мекунад, ки онхо барои пуркуни ва азнавкунии сарчашмаи маълумотхо истифода бурда мешавнд.',
      title_ru: 'OleDbDataAdapte',
      about_ru: '',
      image: ''
    },
    {
      title: 'Connection',
      about: 'пайвастшавие, ки бо нусхаи синфи OleDbCommand истифода бурда мешавад, бармегардонад.',
      title_ru: 'Connection',
      about_ru: '',
      image: ''
    },
    {
      title: 'Provider',
      about: 'Провайдерхои OLE DB ба сарчашмахои маълумотхо ичозат (доступ) медихад.',
      title_ru: 'Provider',
      about_ru: '',
      image: ''
    },
    {
      title: 'ConnectionString Сатри пайвастшави',
      about: 'ин сатри оддии символхое, ки дар он бо аломати «;» нукта вергул параметрхо бо кимматхояшон навишта мешаванд.',
      title_ru: 'ConnectionString Сатри пайвастшави',
      about_ru: '',
      image: ''
    },
    {
      title: 'Объекти DataSet',
      about: 'ин буфер барои нигохдории маълумотхои базаи маълумот. Ин буфер барои нигох доштани маълумоти структури, ки дар холати чадвал оварда мешавад хизмат мекунад, аз хамин сабаб яккумин объекти DataSet объекти DataTable мебошад.',
      title_ru: 'DataSet Объект',
      about_ru: '',
      image: ''
    },
    {
      title: 'DataTable',
      about: 'маълумотхои як чадвалро дар хотира пешниход мекунад.',
      title_ru: 'DataTable',
      about_ru: '',
      image: ''
    },
    {
      title: 'PrimaryKey',
      about: 'массиви сутунхоро бармегардонад, ки онхо сутунхои PrimaryKey дар чадвали махлумотхо мебошанд.',
      title_ru: 'PrimaryKey',
      about_ru: '',
      image: ''
    },
    {
      title: 'Rows',
      about: 'коллектсияи сатрхои чадвалро кабул мекунад.',
      title_ru: 'Rows',
      about_ru: '',
      image: ''
    },
    {
      title: 'Columns',
      about: 'коллексияи сутунхои чадвалро кабул мекунад.',
      title_ru: 'Columns',
      about_ru: '',
      image: ''
    },
    {
      title: 'DataAdapte',
      about: 'командахои маълумот ва пайвастшави ба базаи маълумотро пешниход мекунад, ки онхо барои пуркуни ва азнавкунии сарчашмаи маълумотхо истифода бурда мешавнд.',
      title_ru: 'DataAdapte',
      about_ru: '',
      image: ''
    },
    {
      title: 'Протседура',
      about: 'ба истифодабаранда маълумоти дарахтшаклро нишон медихад, ки онхо метавонанд расмро дар бар гиранд.',
      title_ru: 'Протседура',
      about_ru: '',
      image: ''
    },
    {
      title: 'Функсия',
      about: '',
      title_ru: 'Функсия',
      about_ru: '',
      image: ''
    },
    {
      title: 'Реестр',
      about: 'базаи маълумоти иерархӣ, ки дар он системаи оператсионӣ маълумотро ба таври марказонидашуда нигоҳ медорад, аз ҷумла, сохтори  системаи ҳисоббарорро ки қиматҳои гуногун дорад. ',
      title_ru: 'Реестр',
      about_ru: 'иерархическая база данных, в которой операционная система централизованным образом хранит всю системную информацию, в частности, конфигурацию вычислительной системы, значения различных параметров, сведения об установленных программах и т.д. Изменения в реестре производятся пользователем в окне редактирования реестра.',
      image: ''
    },
    {
      title: 'Нусхабардорӣ',
      about: 'нусхаи мундариҷаи диск, барнома, файл, ҳуҷҷат, ки барои ҳолатҳои фавқулода сохта мешавад. ',
      title_ru: 'Резервная копия ',
      about_ru: 'запасная копия содержимого диска, программы, файла, документа, создаваемая для использования в случае повреждения оригинала',
      image: ''
    },
    // {
    //   title: '',
    //   about: '',
    //   title_ru: '',
    //   about_ru: '',
    //   image: ''
    // },
    // {
    //   title: '',
    //   about: '',
    //   title_ru: '',
    //   about_ru: '',
    //   image: ''
    // },
    // {
    //   title: '',
    //   about: '',
    //   title_ru: '',
    //   about_ru: '',
    //   image: ''
    // },
    // {
    //   title: '',
    //   about: '',
    //   title_ru: '',
    //   about_ru: '',
    //   image: ''
    // },
    // {
    //   title: '',
    //   about: '',
    //   title_ru: '',
    //   about_ru: '',
    //   image: ''
    // },
    // {
    //   title: '',
    //   about: '',
    //   title_ru: '',
    //   about_ru: '',
    //   image: ''
    // },
    // {
    //   title: '',
    //   about: '',
    //   title_ru: '',
    //   about_ru: '',
    //   image: ''
    // },
    // {
    //   title: '',
    //   about: '',
    //   title_ru: '',
    //   about_ru: '',
    //   image: ''
    // },
    // {
    //   title: '',
    //   about: '',
    //   title_ru: '',
    //   about_ru: '',
    //   image: ''
    // },
    // {
    //   title: '',
    //   about: '',
    //   title_ru: '',
    //   about_ru: '',
    //   image: ''
    // },
    // {
    //   title: '',
    //   about: '',
    //   title_ru: '',
    //   about_ru: '',
    //   image: ''
    // },
    ];
  constructor() { }

  ngOnInit() {
  }

}
