import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-inform',
  templateUrl: './inform.component.html',
  styleUrls: ['./inform.component.css']
})
export class InformComponent implements OnInit {

  selectedIndex = false;

  informElements = [
    {
     title: 'Низоми  информатсионӣ',
     about: ' низоми ҷамъкунӣ, нигоҳдорӣ, ҷустуҷӯӣ ва додугирифти маълумот мебошад. ',
     title_ru: 'Информационная система',
      about_ru: ' система сбора, сохранения, нагромождения, поиска и передачи информации.',
      image: './assets/'
    },
    {
      title: 'Технологияи информатсионӣ',
      about: 'раванди технологӣ, ки предмети азнавкунӣ ва натиҷаи он маълумот мебошад. Маҷмӯи мақсадноки ташкилии равандҳои иттилоотӣ бо истифодаи воситаҳои техникаи ҳисоббарор, ки суръати баланди коркарди маълумот, ҷустуҷӯӣ тези маълумот, дастрасӣ ба сарчашмаи маълумотро новобаста аз ҷойгиршавиро таъмин мекунад.',
      title_ru: 'Информационная технология ',
      about_ru: 'технологический процесс, предметом переделывания и результатом которого является информация.  Целеустремленная организованная совокупность информационных процессов с использованием средств вычислительной техники, что обеспечивают высокую скорость обработки данных, быстрый поиск информации, рассредоточение данных, доступ к источникам информации независимо от места их расположения.',
      image: './assets/'
    },
    {
      title: 'Иттилоотикунонӣ',
      about: 'маҷмӯӣ ба ҳамтаъсири равандҳои ташкилӣ, ҳуқуқӣ, сиёсӣ, иҷтимоӣ-иқтисодӣ, илмӣ-техникӣ, равандҳои истеҳсолӣ, ки барои сохтани шароити талаботи иттилотии халқ ва ҷамъият бо роҳи рушд ва истифодаи низомҳои иттилоотӣ, шабакаҳо, захираҳои ва технологияи информатсионӣ, ки дар истифодаи техникаи ҳисоббарор ва коммуникатсионӣ асос меёбад, равона шудааст. ',
      title_ru: 'Информатизация ',
      about_ru: 'совокупность взаимосвязанных организационных, правовых, политических, социально-экономических, научно-технических, производственных процессов, что направлены на создание условий для удовлетворения информационных потребностей граждан и общества путем разработки, развития и использования информационных систем, сетей, ресурсов и информационных технологий, которые базируются на применении современной вычислительной и коммуникационной техники.',
      image: './assets/'
    },
    {
      title: 'Информатика',
      about: 'илме, ки қонунҳо, усулҳо ва роҳи нагромождение, коркард ва додугирифти маълумотро бо воситаи компютер ва дигар воситаҳои техникӣ ба амал меорад. ',
      title_ru: 'Информатика',
      about_ru: 'наука, которая изучает законы, методы и способы нагромождения, обработка и передача информации посредством компьютеров и других технических средств.',
      image: './assets/'
    },
    {
      title: 'Маълумот',
      about: 'хабар оид ба субъект, объект, ҳодиса ё раванд мебошад. Дар тарҷума аз забони лотинӣ баён кардан, хабар додан оид ба чизе мебошад. ',
      title_ru: 'Информация',
      about_ru: 'сведения о субъекте, объекте, явлении и процессе. В переводе с латинского языка означает: разъяснение, изложение чего-либо или сведения о чём-либо.',
      image: './assets/'
    },
    {
      title: 'Каталог',
      about: 'дар системаҳои коркарди маълумот – номгӯи файлҳо, ҷамъи маълумот ё библиотекаҳои барномаҳо, ки дорои ҳавола ба ҷойгиршавии онҳо ва дигар маълумот мебошад. 2 дар файлҳои системавии файлӣ – воситаи мантиқии ташкил ва гурӯҳбандии файлҳо дар диск, ки нишондиҳандаи бақайдгирии файл ё каталоги сатҳи ояндаи иерархияро дар бар мегирад. ',
      title_ru: 'Каталог ',
      about_ru: '1.  В системах обработки информации - перечень файлов, наборов данных и библиотек программ, который содержит ссылку на их расположившее и другую справочную информацию. 2.  В иерархической файловой системе - средство логической организации и группировки файлов на диске, что представляет собой указатель, в котором регистрируются файлы и каталоги следующего уровня иерархии (подкаталоги).',
      image: './assets/'
    },
    {
      title: 'Каталоги ибтидоӣ ',
      about: 'ин каталоги асосии ҳар як диск мебошад. Дар он файлҳои одӣ ва каталоги дараҷаи 1 ба қайд гирифта мешавад.',
      title_ru: 'Каталог корневой',
      about_ru: 'это главный каталог каждого диска. В нем регистрируются обыч­ные файлы и каталоги 1 уровня. В каталогах 1 уровня, в свою очередь, регистриру­ются обычные файлы и каталоги 2 уровня и т.д. Имена каталогов, включенных один в другой, отделяются знаком «\\».',
      image: './assets/'
    },
    {
      title: 'Каталоги ҷорӣ  ',
      about: 'каталоге, ки дар он бевосита истифодабаранда ҷойгир аст.',
      title_ru: 'Каталог текущий',
      about_ru: 'каталог, в котором непосредственно находится пользователь.',
      image: './assets/'
    },
    {
      title: 'Муҳити информатсионӣ',
      about: 'Маҷмӯи васоит, шароит ва методҳои дар базаи системаҳои компютерӣ фаъолияткунанда мебошад, ки барои эҷод ва истифодаи захираҳои информатсионӣ равона шудааст.',
      title_ru: 'Информационная среда',
      about_ru: '',
      image: './assets/'
    },
    {
      title: 'Информатика',
      about: 'Илмест, ки доир ба хосиятҳои информатсия ва қонуниятҳои раванди информатсионӣ баҳс менамояд.',
      title_ru: 'Информатика',
      about_ru: '',
      image: './assets/'
    },
    {
      title: 'Технологияҳои информатсионӣ',
      about: 'Яке аз соҳаҳои тафаккури илмӣ буда, ба воситаи системаи таҳлилии ҳодисаҳои муҳити атроф равандҳои информатсионии бо суръати баланд вусъатёбандаро меомӯзад ва методу воситаҳои автоматии ғункунӣ, қабулкунӣ, нигаҳдорӣ, табдил, ирсол, сабт ва истифодаи информатсияро тавассути техникаи компютерӣ мавриди омӯзиш ва коркард қарор медиҳад.',
      title_ru: 'Информационные технологии',
      about_ru: '',
      image: './assets/'
    },
    // {
    //   title: '',
    //   about: '',
    //   image: './assets/'
    // },
  ];
  constructor() { }

  ngOnInit() {
  }

}
